Repository: 359887612/pacemaker
Catalog: doc/Pacemaker_Explained/*/Ap-OCF.po
Languages: it_it

source: More About OCF Resource Agents
it_it: Maggiori informazioni sui Resource Agent OCF

source: Location of Custom Scripts
it_it: Dove si trovano gli script personalizzati

source: OCF Resource Agents are found in <filename>/usr/lib/ocf/resource.d/<replaceable>provider</replaceable></filename>.
it_it: Gli OCF Resource Agent si troviano nel path <filename>/usr/lib/ocf/resource.d/<replaceable>provider</replaceable></filename>.

source: When creating your own agents, you are encouraged to create a new directory under <filename>/usr/lib/ocf/resource.d/</filename> so that they are not confused with (or overwritten by) the agents shipped with Heartbeat. So, for example, if you chose the provider name of bigCorp and wanted a new resource named bigApp, you would create a script called <filename>/usr/lib/ocf/resource.d/bigCorp/bigApp</filename> and define a resource:
it_it: In fase di creazione dei propri Agent l'utente è incoraggiato a creare una nuova cartella sotto <filename>/usr/lib/ocf/resource.d/</filename> in modo che questi non vengano confusi (o sovrascritti) con gli agenti forniti con Heartbeat. Quindi, ad esempio, se viene scelto come nome provider bigCorp ed il nome della nuova risorsa sarà bigApp, andrà creato uno script chiamato <filename>/usr/lib/ocf/resource.d/bigCorp/bigApp</filename> e definita una risorsa:

source: Actions
it_it: Azioni

source: All OCF Resource Agents are required to implement the following actions
it_it: Tutti i Resource Agent OCF devono implementare le seguenti azioni

source: Required Actions for OCF Agents
it_it: Azioni richieste per gli agenti OCF

source: Action
it_it: Azione

source: Description
it_it: Descrizione

source: Instructions
it_it: Istruzioni

source: Start the resource
it_it: Avvia la risorsa

source: Return 0 on success and an appropriate error code otherwise. Must not report success until the resource is fully active.
it_it: Restituisce 0 in caso di successo oppure un appropriato codice di errore. Non deve riportare successo finché la risorsa non è totalmente attiva.

source: Stop the resource
it_it: Ferma la risorsa

source: Return 0 on success and an appropriate error code otherwise. Must not report success until the resource is fully stopped.
it_it: Restituisce 0 in caso di successo oppure un appropriato codice di errore. Non deve riportare successo finché la risorsa non è completamente stoppata.

source: Check the resource&#39;s state
it_it: Controlla lo stato della risorsa

source: Exit 0 if the resource is running, 7 if it is stopped and anything else if it is failed.
it_it: Restituisce 0 se la risorsa sta funzionando, 7 se è stoppata e qualsiasi altro valore se è fallita.

source: NOTE: The monitor script should test the state of the resource on the local machine only.
it_it: NOTA: Lo script di monitor dovrebbe controllare lo stato della risorsa solo sulla macchina locale.

source: Describe the resource
it_it: Descrive la risorsa

source: Provide information about this resource as an XML snippet. Exit with 0.
it_it: Fornisce informazioni in merito a questa risorsa in forma di estr atto di XML. Restituisce 0.

source: NOTE: This is <emphasis>not</emphasis> performed as root.
it_it: NOTA: <emphasis>non</emphasis> viene eseguito come root.

source: Verify the supplied parameters are correct
it_it: Verifica che i parametri passati siano corretti

source: Exit with 0 if parameters are valid, 2 if not valid, 6 if resource is not configured.
it_it: Restituisce 0 se i parametri sono validi, 2 se non sono validi, 6 se la risorsa non è configurata.

source: Additional requirements (not part of the OCF specs) are placed on agents that will be used for advanced concepts like <link linkend="s-resource-clone">clones</link> and <link linkend="s-resource-multistate">multi-state</link> resources.
it_it: Requisiti aggiuntivi (che non fanno parte delle specifiche OCF) sono associati ad agenti che vengono utilizzati nell'ambito delle risorse <link linkend="s-resource-clone">clone</link> e <link linkend="s-resource-multistate">multi-state</link>.

source: Optional Actions for OCF Agents
it_it: Azioni facoltative per gli agent OCF

source: Promote the local instance of a multi-state resource to the master/primary state
it_it: Promuove l'istanza locale di una risorsa multi-state allo stato master/primary

source: Return 0 on success
it_it: Restituisce 0 in caso di successo

source: Demote the local instance of a multi-state resource to the slave/secondary state
it_it: Degrada l'istanza locale di una risorsa multi-state allo stato slave/secondary

source: Used by the cluster to send the agent pre and post notification events telling the resource what is or did just take place
it_it: Utilizzato dal cluster per inviare pre e post notifiche di eventi all'agente indicando cosa sta accadendo o cosa è accaduto alla risorsa

source: Must not fail. Must exit 0
it_it: Non può fallire. Deve restituire 0

source: One action specified in the OCF specs is not currently used by the cluster
it_it: Un'azione definita nelle specifiche OCF non è attalmente utilizzata dal cluster

source: recover - a variant of the start action, this should try to recover a resource locally.
it_it: rescover - una variante dell'azione start, dovrebbe cercare di ripristinare localmente una risorsa.

source: Remember to use ocf-tester to verify that your new agent complies with the OCF standard properly.
it_it: E' necessario ricordare l'utilizzo di ocf-tester per verificare che i nuovi agenti creati siano propriamente compatibili con lo standard OCF.

source: How Does the Cluster Interpret the OCF Return Codes?
it_it: Il cluster come interpreta i codici di ritorno OCF?

source: The first thing the cluster does is check the return code against the expected result. If the result does not match the expected value, then the operation is considered to have failed and recovery action is initiated.
it_it: La prima cosa che il cluster fa è controllare il codice di ritorno rispetto ai risultati attesi. Se il risultato non combacia con i valori attesi, allora l'operazione viene considerata fallita e viene avviata un'azione di ripristino.

source: There are three types of failure recovery:
it_it: Esistono tre tipi di ripristino da fallimenti:

source: Types of recovery performed by the cluster
it_it: Tipi di ripristino effettuati dal cluster

source: Recovery Type
it_it: Tipo di ripristino

source: Action Taken by the Cluster
it_it: Azione intrapresa dal cluster

source: A transient error occurred
it_it: Si è verificato un errore transitorio

source: Restart the resource or move it to a new location
it_it: Riavvia la risora o la sposta in una nuova posizione

source: A non-transient error that may be specific to the current node occurred
it_it: Si è verificato un errore non transitorio che potrebbe essere specificamente correlato al nodo attuale

source: Move the resource elsewhere and prevent it from being retried on the current node
it_it: Sposta altrove la risorsa e previene che questa venga riavviata sul nodo attuale

source: A non-transient error that will be common to all cluster nodes (I.e. a bad configuration was specified)
it_it: Si è verificato un errore non transitorio che sarà associato a tutti i nodi del cluster (ad esempio una configurazione sbagliata)

source: Stop the resource and prevent it from being started on any cluster node
it_it: Ferma la risorsa ed evita che venga avviata da qualsiasi nodo del cluster

source: Assuming an action is considered to have failed, the following table outlines the different OCF return codes and the type of recovery the cluster will initiate when it is received.
it_it: Assumendo che l'azione sia considerata fallita, la seguente tabella evidenzia i diversi codici di ritorno OCF ed i tipi di ripristino che il cluster avvierà di conseguenza.

source: OCF Return Codes and How They are Handled
it_it: Codici di ritorno OCF e come sono gestiti

source: Success. The command complete successfully. This is the expected result for all start, stop, promote and demote commands.
it_it: Successo. Il comando è stato completato con successo. E' il risultato atteso per tutte le operazioni di start, stop, promote e demote.

source: Generic &#34;there was a problem&#34; error code.
it_it: Codice di errore generico &#34;c'è stato un problema&#34;

source: The resource&#39;s configuration is not valid on this machine. Eg. Refers to a location/tool not found on the node.
it_it: La configurazione della risorsa su questa macchina è invalida. Ad esempio riferisce ad uno strumento/posizione non trovato all'interno del nodo.

source: The requested action is not implemented.
it_it: L'azione richiesta non è implementata.

source: The resource agent does not have sufficient privileges to complete the task.
it_it: L'agente della risorsa non ha privilegi sufficienti per completare l'operazione.

source: The tools required by the resource are not installed on this machine.
it_it: I tool richiesti dalla risorsa non sono installati su questa macchina.

source: The resource&#39;s configuration is invalid. Eg. A required parameters are missing.
it_it: La configurazione della risorsa è invalida. Ad esempio manca un parametro richiesto.

source: The resource is safely stopped. The cluster will not attempt to stop a resource that returns this for any action.
it_it: La risosra è ferma in sicurezza. Il cluster non cercherà di fermare una risorsa con questo codice di ritorno per qualsiasi azione.

source: The resource is running in Master mode.
it_it: La risorsa sta funzionando in modalità Master.

source: The resource is in Master mode but has failed. The resource will be demoted, stopped and then started (and possibly promoted) again.
it_it: La risorsa è in modalità Master, ma ha fallito. La risorsa verrà degradata, fermata e quindi avviata (e possibilmente promossa) di nuovo.

source: Custom error code.
it_it: Codice di errore personalizzato.

source: Although counter intuitive, even actions that return 0 (aka. <envar>OCF_SUCCESS</envar>) can be considered to have failed. This can happen when a resource that is expected to be in the Master state is found running as a Slave, or when a resource is found active on multiple machines..
it_it: E' facilmente intuibile come anche le azioni che restituiscono 0 (quindi <envar>OCF_SUCCESS</envar>) possono essere considerate fallite. Questo può succedere quando una risorsa attesa in stato Master venga trovata in realtà attiva ma in stato Slave, oppure quando una risorsa viene trovata attiva su più macchine.

source: Exceptions
it_it: Eccezioni

source: Non-recurring monitor actions (probes) that find a resource active (or in Master mode) will not result in recovery action unless it is also found active elsewhere
it_it: Azioni di monitor non ricorrenti (probes) che trovano una risorsa attiva (o in modalità Master) non forzeranno un ripristino a meno che non trovino la risorsa attiva altrove

source: The recovery action taken when a resource is found active more than once is determined by the <literal>multiple-active</literal> property of the resource
it_it: L'azione di ripristino intrapresa quando una risorsa viene trovata attiva più di una volta è determinata dalla proprietà <literal>multiple-active</literal>

source: Recurring actions that return <envar>OCF_ERR_UNIMPLEMENTED</envar> do not cause any type of recovery
it_it: Azioni ricorrenti che restituiscono <envar>OCF_ERR_UNIMPLEMENTED</envar> non forzano alcun tipo di ripristino
