Repository: 359887612/pacemaker
Catalog: doc/Pacemaker_Explained/*/Ch-Advanced-Resources.po
Languages: it_it

source: Advanced Resource Types
it_it: Tipi di risorse avanzati

source: Groups - A Syntactic Shortcut
it_it: Gruppi - Una scorciatoia sintattica

source: One of the most common elements of a cluster is a set of resources that need to be located together, start sequentially and stop in the reverse order. To simplify this configuration we support the concept of groups.
it_it: Fra gli elementi più comuni all'interno dei cluster ci sono i set di risorse che necessitano di essere posizionate insieme, avviarsi sequenzialmente e stopparsi nell'ordine inverso. Per semplificare questa configurazione è stato creato il concetto di gruppi.

source: An example group
it_it: Un esempio di gruppo

source: Although the example above contains only two resources, there is no limit to the number of resources a group can contain. The example is also sufficient to explain the fundamental properties of a group:
it_it: Anche se l'esempio illustrato sopra contiene solo due risorse, non esiste limite al numero di risorse che un gruppo può contenere. L'esempio è comunque sufficiente per illustrare le proprietà fondamentali di un gruppo:

source: Resources are started in the order they appear in (Public-IP first, then Email)
it_it: Le risorse vengono avviate nell'ordine in cui appaiono (prima Public-IP, poi Email)

source: Resources are stopped in the reverse order to which they appear in (Email first, then Public-IP)
it_it: Le risorse vengono stoppate in ordine inverso rispetto a come appaiono (prima Email, poi Public-IP)

source: If a resource in the group can&#39;t run anywhere, then nothing after that is allowed to run
it_it: Se una risorsa nel gruppo non può essere avviata ovunque, allora tutto quel che segue non verrà avviato

source: If Public-IP can’t run anywhere, neither can Email
it_it: Se Public-IP non può essere avviata ovunque, anche Email non verrà avviata

source: If Email can’t run anywhere, this does not affect Public-IP in any way
it_it: Il fatto che Email non può essere avviata ovunque non influisce minimamente su Public-IP

source: The group above is logically equivalent to writing:
it_it: Il gruppo descritto è locicamente equivalente alla seguente definizione:

source: How the cluster sees a group resource
it_it: Come il gruppo di risorse è visto dal cluster

source: Obviously as the group grows bigger, the reduced configuration effort can become significant.
it_it: Ovviamente a fronte di gruppi che crescono in grandezza, il risparmio di dichiarazioni in configurazione può diventare considerevole

source: Properties
it_it: Proprietà

source: Properties of a Group Resource
it_it: Proprietà di un gruppo di risorse

source: Field
it_it: Campo

source: Description
it_it: Descrizione

source: Your name for the group
it_it: Nome del gruppo

source: Options
it_it: Opzioni

source: Options inherited from <link linkend="s-resource-options">simple resources</link>: <literal>priority, target-role, is-managed</literal>
it_it: Opzioni ereditate da <link linkend="s-resource-options">simple resources</link>: <literal>priority, target-role, is-managed</literal>

source: Using Groups
it_it: Utilizzare i gruppi

source: Instance Attributes
it_it: Attributi dell'istanza

source: Groups have no instance attributes, however any that are set here will be inherited by the group&#39;s children.
it_it: I gruppi non hanno attributi di istanza, ad ogni modo qualsiasi attributo dichiarato all'interno verrà ereditato dai componenti del gruppo.

source: Contents
it_it: Contenuti

source: Groups may only contain a collection of <link linkend="s-resource-supported">primitive</link> cluster resources. To refer to the child of a group resource, just use the child&#39;s id instead of the group&#39;s.
it_it: I gruppi possono contenere unicamente una collezione di risorse di tipo <link linkend="s-resource-supported">primitive</link> . Per riferirsi ad un membro del gruppo è sufficiente utilizzare l'id del membro anziché quello del gruppo.

source: Although it is possible to reference the group&#39;s children in constraints, it is usually preferable to use the group&#39;s name instead.
it_it: Anche se è possibile riferirsi ai membri del gruppo nelle constraint, è preferibile utilizzare direttamente il nome del gruppo.

source: Example constraints involving groups
it_it: Esempio di constraint che coinvolgono i gruppi

source: Stickiness, the measure of how much a resource wants to stay where it is, is additive in groups. Every active member of the group will contribute its stickiness value to the group&#39;s total. So if the default <literal>resource-stickiness</literal> is 100 a group has seven members, five of which are active, then the group as a whole will prefer its current location with a score of 500.
it_it: La Stickiness, ossia la misura di quanto una risorsa vuole rimanere dov'è, all'interno dei gruppi è sommata per ciascun membro. Ogni membro attivo contribuirà con il proprio valore di stickiness al totale del gruppo. Quindi se la <literal>resource-stickiness</literal> di default è 100 ed un gruppo ha sette membri, cinque dei quali attivi, allora il gruppo preferirà la locazione attuale con un punteggio di 500.

source: Clones - Resources That Should be Active on Multiple Hosts
it_it: Cloni - Risorse che devono essere attive su host multipli8

source: Clones were initially conceived as a convenient way to start N instances of an IP resource and have them distributed throughout the cluster for load balancing. They have turned out to quite useful for a number of purposes including integrating with Red Hat&#39;s DLM, the fencing subsystem and OCFS2.
it_it: Le risorse clone sono stati inizialmente concepiti come una via economica per avere N istanze di una risorsa IP distribuite nel cluster per il bilanciamento del carico. Esse sono tornate poi utili per diversi scopi, compresa l'integrazione con il sistema DLM di Red Hat, il sottosistema di fencing ed OCFS2.

source: You can clone any resource provided the resource agent supports it.
it_it: E' possibile clonare qualsiasi risorsa se il resource agent lo supporta.

source: Three types of cloned resources exist.
it_it: Esistono tre tipi di risorsa clonata.

source: Anonymous clones are the simplest type. These resources behave completely identically everywhere they are running. Because of this, there can only be one copy of an anonymous clone active per machine.
it_it: I cloni di tipo Anonymous sono il tipo più semplice. Queste risorse si comportano in maniera identica ovunque sono avviate. Per questo può esistere solo una copia attiva di un clone di tipo Anonymous per ciascuna macchina.

source: Globally unique clones are distinct entities. A copy of the clone running on one machine is not equivalent to another instance on another node. Nor would any two copies on the same node be equivalent.
it_it: I cloni di tipo Globally unique sono entità distinte. Una copia del clone che funziona su una macchina non è equivalente ad un'altra istanza su un altro nodo. Due copie sullo stesso nodo non sarebbero comunque equivalenti.

source: Stateful clones are covered later in <xref linkend="s-resource-multistate" />.
it_it: I cloni di tipo Stateful sono descritti nella sezione <xref linkend="s-resource-multistate" />.

source: An example clone
it_it: Un esempio di risorsa clonata

source: Properties of a Clone Resource
it_it: Proprietà di una risorsa di tipo clone

source: Your name for the clone
it_it: Nome del clone

source: Options inherited from <link linkend="s-resource-supported">simple resources</link>: <literal>priority, target-role, is-managed</literal>
it_it: Opzioni ereditate da <link linkend="s-resource-supported">simple resources</link>: <literal>priority, target-role, is-managed</literal>

source: Clone specific configuration options
it_it: Opzioni specifiche di configurazione per le risorse Clone

source: How many copies of the resource to start. Defaults to the number of nodes in the cluster.
it_it: Quante copie della risorsa è necessario avviare. Il valore di default è il numero dei nodi del cluster.

source: How many copies of the resource can be started on a single node. Defaults to 1.
it_it: Quante copie della risorsa possono essere avviate sul singolo nodo. Il default è 1.

source: When stopping or starting a copy of the clone, tell all the other copies beforehand and when the action was successful. Allowed values: true, <emphasis>false</emphasis>
it_it: Quando una copia del clone viene avviata o stoppata, comunica l'azione in anticipo alle altre copie e comunica quando l'azione ha successo. Valori permessi: true, <emphasis>false</emphasis>

source: Does each copy of the clone perform a different function? Allowed values: true, <emphasis>false</emphasis>
it_it: Ogni copia del clone può eseguire funzioni differenti? Valori permessi: true, <emphasis>false</emphasis>

source: Should the copies be started in series (instead of in parallel). Allowed values: true, <emphasis>false</emphasis>
it_it: Le copie devono essere avviate in serie (anziché in parallelo)? Valori permessi: true, <emphasis>false</emphasis>

source: Changes the behavior of ordering constraints (between clones/masters) so that instances can start/stop as soon as their peer instance has (rather than waiting for every instance of the other clone has). Allowed values: true, <emphasis>false</emphasis>
it_it: Modifica il comportamento delle constraint di tipo order (fra cloni/master) in modo che le istanze possano essere avviate e stoppate appena le rispettive istanze lo sono (anziché aspettare che ogni istanza degli altri cloni sia stata avviata o stoppata). Valori permessi: true, <emphasis>false</emphasis>

source: Using Clones
it_it: Utilizzare le risorse clone

source: Clones have no instance attributes, however any that are set here will be inherited by the clone&#39;s children.
it_it: Le risorse clone non possiedono attributi istanza, ad ogni modo questi se valorizzati vengono ereditati da tutte le risorse clone figlio.

source: Clones must contain exactly one group or one regular resource.
it_it: Le risorse clone devono contenere esattamente un gruppo od una risorsa regolare.

source: You should never reference the name of a clone&#39;s child. If you think you need to do this, you probably need to re-evaluate your design.
it_it: Non bisognerebbe mai riferirsi direttamente alle risorse clone figlio. Se è nelle proprie intenzioni farlo, allora probabilmente sarà necessario rivedere i propri piani.

source: In most cases, a clone will have a single copy on each active cluster node. However if this is not the case, you can indicate which nodes the cluster should to preferentially assign copies to with resource location constraints. These constraints are written no differently to those for regular resources except that the clone&#39;s id is used.
it_it: In molti casi, un clone avrà una singola copia della risorsa su ogni nodo attivo del cluster. Ad ogni modo è possibile indicare a quali nodi del cluster assegnare le copie delle risorse mediante contraint di tipo location. Queste constraint sono scritte in maniera del tutto simile a quelle delle risorse regolari, eccezione fatta per l'id utilizzato che deve essere quello della risorsa clone.

source: Ordering constraints behave slightly differently for clones. In the example below, apache-stats will wait until all copies of the clone that need to be started have done so before being started itself. Only if no copies can be started will apache-stats be prevented from being active. Additionally, the clone will wait for apache-stats to be stopped before stopping the clone.
it_it: Le constraint di tipo order funzionano in una forma differente per i cloni. Nell'esempio sotto, apache-stats aspetterà finché tutte le copie del clone che necessitano di essere avviate lo siano. Solo se nessuna copia può essere avviata ad apache-stats verrà impedito di avviarsi. In aggiunta, la risorsa clone aspetterà che apache-stats sia stoppata prima di stoppare se stessa.

source: Colocation of a regular (or group) resource with a clone means that the resource can run on any machine with an active copy of the clone. The cluster will choose a copy based on where the clone is running and the rsc resource&#39;s own location preferences.
it_it: Effettuare una colocation di una risorsa (o gruppo) con un clone significa che la risorsa può funzionare su qualsiasi macchine che possiede una copia attiva del clone. Il cluster sceglierà la copia in base a dove il clone sta funzionando ed in base alle preferenze di locazione della risorsa (rsc).

source: Colocation between clones is also possible. In such cases, the set of allowed locations for the rsc clone is limited to nodes on which the with clone is (or will be) active. Allocation is then performed as-per-normal.
it_it: E' possibile utilizzare colocation con le risorse clone. In questi casi il set di locazioni consentite per la risorsa clone viene limitato ai nodi su cui il clone è (o sarà) attivo. A questo punto l'allocazione verrà effettuata normalmente.

source: Example constraints involving clones
it_it: Esempi di constraint che coinvolgono cloni

source: To achieve a stable allocation pattern, clones are slightly sticky by default. If no value for <literal>resource-stickiness</literal> is provided, the clone will use a value of 1. Being a small value, it causes minimal disturbance to the score calculations of other resources but is enough to prevent Pacemaker from needlessly moving copies around the cluster.
it_it: Per fare in modo che abbiano una locazione stabile le risorse clone sono per default sticky (ossia collose). Se non viene specificato alcun valore relativo a <literal>resource-stickiness</literal>, la risorsa clone utilizzerà il valore di 1. Essendo un valore ridotto, esso causa il disturbo minimo nel calcolo del punteggio delle altre risorse, ma è sufficiente per prevenire Pacemaker dal muovere inutilmente copie delle risorse nel cluster.

source: Resource Agent Requirements
it_it: Requisiti del resource agent

source: Any resource can be used as an anonymous clone as it requires no additional support from the resource agent. Whether it makes sense to do so depends on your resource and its resource agent.
it_it: Ogni risorsa può essere usata come un clone anonimo dato che non richiede supporto aggiuntivo all'interno del resource agent. Dove abbia senso fare ciò dipende dalla propria risorsa e dal relativo resource agent.

source: Globally unique clones do require some additional support in the resource agent. In particular, it must only respond with <envar>${OCF_SUCCESS}</envar> if the node has that exact instance active. All other probes for instances of the clone should result in <envar>${OCF_NOT_RUNNING}</envar>. Unless of course they are failed, in which case they should return one of the other OCF error codes.
it_it: I cloni di tipo Globally unique richiedono supporto aggiuntivo all'interno del resource agent. In particolare, la risorsa dovrà rispondere solamente con <envar>${OCF_SUCCESS}</envar> se il nodo ha l'esatta istanza attiva. Tutti gli altri tipi di interrogazione sul clone dovrebbero risultare in <envar>${OCF_NOT_RUNNING}</envar>. A meno che ovviamente esse falliscano, caso in cui dovranno restituire i relativi codici di errore OCF.

source: Copies of a clone are identified by appending a colon and a numerical offset. Eg. apache:2
it_it: Le copie di un clone vengono identificate con l'aggiunta di due punti ed un contatore numerico. Ad esempio apache:2

source: Resource agents can find out how many copies there are by examining the <envar>OCF_RESKEY_CRM_meta_clone_max</envar> environment variable and which copy it is by examining <envar>OCF_RESKEY_CRM_meta_clone</envar>.
it_it: Un resource agent può ricavare quante copie di se stesso sono attive esaminando la variabile d'ambiente <envar>OCF_RESKEY_CRM_meta_clone_max</envar> e quale copia questa sia analizzando <envar>OCF_RESKEY_CRM_meta_clone</envar>.

source: You should not make any assumptions (based on <envar>OCF_RESKEY_CRM_meta_clone</envar>) about which copies are active. In particular, the list of active copies will not always be an unbroken sequence, nor always start at 0.
it_it: E' bene non fare assunzioni (basandosi su <envar>OCF_RESKEY_CRM_meta_clone</envar>) su quali copie siano attive. In particolare la lista delle copie attive non sarà necessariamente in sequenza e non partirà necessariamente da 0.

source: Notifications
it_it: Notifiche

source: Supporting notifications requires the <literal>notify</literal> action to be implemented. Once supported, the notify action will be passed a number of extra variables which, when combined with additional context, can be used to calculate the current state of the cluster and what is about to happen to it.
it_it: Il supporto alle notifiche comporta che l'azione <literal>notify</literal> sia implementata. Una volta che questa è supportata all'azione notify verranno passate un numero di variabili extra che, quando combinate con le informazioni aggiuntive, potranno essere utilizzate per calcolare lo stato attuale del cluster e cosa sta per succedere ad esso.

source: Environment variables supplied with Clone notify actions
it_it: Variabili d'ambiente fornite alle azioni notify delle risorse clone

source: Variable
it_it: Variabile

source: Allowed values: pre, post
it_it: Valori permessi: pre, post

source: Allowed values: start, stop
it_it: Valori permessi: start, stop

source: Resources to be started
it_it: La risorsa da avviare

source: Resources to be stopped
it_it: La risorsa da stoppare

source: Resources the that are running
it_it: Le risorse che stanno funzionando

source: Resources the that are not running
it_it: Le risorse che non stanno funzionando

source: Nodes on which resources will be started
it_it: I nodi su cui le risorse verranno avviate

source: Nodes on which resources will be stopped
it_it: I nodi su cui le risorse verranno stoppate

source: Nodes on which resources are running
it_it: I nodi su cui le risorse stanno funzionando

source: Nodes on which resources are not running
it_it: I nodi su cui le risorse non stanno funzionando

source: The variables come in pairs, such as <envar>OCF_RESKEY_CRM_meta_notify_start_resource</envar> and <envar>OCF_RESKEY_CRM_meta_notify_start_uname</envar> and should be treated as an array of whitespace separated elements.
it_it: Le variabili vengono considerate a coppie, come <envar>OCF_RESKEY_CRM_meta_notify_start_resource</envar> e <envar>OCF_RESKEY_CRM_meta_notify_start_uname</envar> e dovrebbero essere tratta come un array di elementi separati da spazi.

source: Thus in order to indicate that clone:0 will be started on sles-1, clone:2 will be started on sles-3, and clone:3 will be started on sles-2, the cluster would set
it_it: Quindi per indicare che clone:0 verrà avviato su sles-, clone:2 verrà avviato su sles-3 e clone:3 verrà avviato su sles-2, il cluser imposterà

source: Example notification variables
it_it: Esempio di variabili notifica

source: Proper Interpretation of Notification Environment Variables
it_it: Corretta interpretazione delle variabili di notifica d'ambiente

source: Active resources: $OCF_RESKEY_CRM_meta_notify_active_resource
it_it: Risorse attive: $OCF_RESKEY_CRM_meta_notify_active_resource

source: Inactive resources: $OCF_RESKEY_CRM_meta_notify_inactive_resource
it_it: Risorse inattive: $OCF_RESKEY_CRM_meta_notify_inactive_resource

source: Resources to be started: $OCF_RESKEY_CRM_meta_notify_start_resource
it_it: Risorse da avviare: $OCF_RESKEY_CRM_meta_notify_start_resource

source: Resources to be stopped: $OCF_RESKEY_CRM_meta_notify_stop_resource
it_it: Risorse da stoppare: $OCF_RESKEY_CRM_meta_notify_stop_resource

source: Active resources:
it_it: Risorse attive:

source: minus $OCF_RESKEY_CRM_meta_notify_stop_resource
it_it: meno $OCF_RESKEY_CRM_meta_notify_stop_resource

source: Inactive resources:
it_it: Risorse inattive:

source: plus $OCF_RESKEY_CRM_meta_notify_stop_resource
it_it: più $OCF_RESKEY_CRM_meta_notify_stop_resource

source: Resources that were started: $OCF_RESKEY_CRM_meta_notify_start_resource
it_it: Risorse che sono state avviate: $OCF_RESKEY_CRM_meta_notify_start_resource

source: Resources that were stopped: $OCF_RESKEY_CRM_meta_notify_stop_resource
it_it: Risorse che sono state stoppate: $OCF_RESKEY_CRM_meta_notify_stop_resource

source: plus $OCF_RESKEY_CRM_meta_notify_start_resource
it_it: più $OCF_RESKEY_CRM_meta_notify_start_resource

source: minus $OCF_RESKEY_CRM_meta_notify_start_resource
it_it: meno $OCF_RESKEY_CRM_meta_notify_start_resource

source: Multi-state - Resources That Have Multiple Modes
it_it: Multi-state - Risorse con modalità multipla

source: Multi-state resources are a specialization of Clones (please ensure you understand the section on clones before continuing) that allow the instances to be in one of two operating modes. These modes are called Master and Slave but can mean whatever you wish them to mean. The only limitation is that when an instance is started, it must come up in the Slave state.
it_it: Le risorse multi-state sono una specializzazione delle risorse clone (assicurarsi di aver compreso la sezione precedente relativa alle risorse clone prima di continuare) che consentono alle istanze di essere in una delle due modalità operative. Queste modalità sono chiamate Master e Slave ma tali nomi possono avere il significato che gli si vuole attribuire. L'unica limitazione è che quando un'istanza viene avviata, deve esserlo in stato Slave.

source: Properties of a Multi-State Resource
it_it: Proprietà delle risorse multi-state

source: Your name for the multi-state resource
it_it: Nome della risorsa multi-state

source: Options inherited from <link linkend="s-resource-clone">clone resources</link>: <literal>clone-max, clone-node-max, notify, globally-unique, ordered, interleave</literal>
it_it: Opzioni ereditate da <link linkend="s-resource-clone">clone resources</link>: <literal>clone-max, clone-node-max, notify, globally-unique, ordered, interleave</literal>

source: Multi-state specific resource configuration options
it_it: Opzioni di configurazione specifiche alle risorse multi-state

source: How many copies of the resource can be promoted to master status. Defaults to 1.
it_it: Quante copie della risorsa possono essere promosse allo status master. Valore di default 1.

source: How many copies of the resource can be promoted to master status on a single node. Defaults to 1.
it_it: Quante copie della risorsa possono essere promosse allo status master su un singolo nodo. Valore di default 1.

source: Using Multi-state Resources
it_it: Utilizzare le risorse multi-state

source: Multi-state resources have no instance attributes, however any that are set here will be inherited by the master&#39;s children.
it_it: Le risorse multi-state non hanno attributi di istanza, ad ogni modo qualsiasi attributo settato viene ereditato dai figli del master.

source: Masters must contain exactly one group or one regular resource.
it_it: Le risorse master devono contenere esattamente un gruppo o una singola risorsa regolare.

source: You should never reference the name of a master&#39;s child. If you think you need to do this, you probably need to re-evaluate your design.
it_it: Non ci si dovrebbe mai riferire direttamente alle risorse figlio del master. Se è nelle proprie intenzioni farlo, allora probabilmente sarà necessario rivedere i propri piani.

source: Monitoring Multi-State Resources
it_it: Monitoraggio delle risorse multi-state
