Repository: 359887612/pacemaker
Catalog: doc/Pacemaker_Explained/*/Ch-Advanced-Resources.po
Languages: it_it

source: The normal type of monitor actions you define are not sufficient to monitor a multi-state resource in the Master state. To detect failures of the master instance, you need to define an additional monitor action with <literal>role=&#34;Master&#34;</literal>.
it_it: L'azione di monitor normale che viene definita non è sufficiente a monitorare una risorsa multi-state che è in stato master. Per rilevare malfunzionamenti sull'istanza master è necessario definire azioni di monitoraggio aggiuntive mediante <literal>role=&#34;Master&#34;</literal>.

source: It is crucial that every monitor operation has a different interval
it_it: E' cruciale che ogni operazione di monitora avvenga in intervalli differenti

source: Monitoring both states of a multi-state resource
it_it: Monitorare entrambi gli stati di una risorsa multi-state

source: In most cases, a multi-state resources will have a single copy on each active cluster node. However if this is not the case, you can indicate which nodes the cluster should to preferentially assign copies to with resource location constraints. These constraints are written no differently to those for regular resources except that the master&#39;s id is used.
it_it: Nella maggioranza dei casi, una risorsa multi-state avrà una singola copia su ogni nodo del cluster attivo. Ad ogni modo è possibile indicare a quali nodi del cluster assegnare le copie delle risorse mediante contraint di tipo location. Queste constraint sono scritte in maniera del tutto simile a quelle delle risorse regolari, eccezione fatta per l'id utilizzato che deve essere quello della risorsa master.

source: When considering multi-state resources in constraints, for most purposes it is sufficient to treat them as clones. The exception is when the <literal>rsc-role</literal> and/or <literal>with-rsc-role</literal> (for colocation constraints) and <literal>first-action</literal> and/or <literal>then-action</literal> (for ordering constraints) are used.
it_it: Quando si considerano le risorse multi-state all'interno delle constraint, generalmente è sufficiente trattarle come cloni. L'eccezione avviene quando sono utilizzati i valori <literal>rsc-role</literal> e/o <literal>with-rsc-role</literal> (per constraint di tipo colocation) e <literal>first-action</literal> e/o <literal>then-action</literal> (per constraint di tipo order).

source: Additional constraint options relevant to multi-state resources
it_it: Opzioni aggiuntive per le constraint relative alle risorse multi-state

source: An additional attribute of colocation constraints that specifies the role that rsc must be in.
it_it: Un'attributo aggiuntivo di una constraint colocation che specifica il ruolo in cui la risorsa (rsc) dovrà trovarsi.

source: Allowed values: <emphasis>Started</emphasis>, Master, Slave
it_it: Valori permessi: <emphasis>Started</emphasis>, Master, Slave

source: An additional attribute of colocation constraints that specifies the role that with-rsc must be in.
it_it: Un'attributo aggiuntivo di una constraint colocation che specifica il ruolo in cui la risorsa associata (with-rsc) dovrà trovarsi.

source: An additional attribute of ordering constraints that specifies the action that the first resource must complete before executing the specified action for the then resource.
it_it: Un'attributo aggiuntivo di una constraint di tipo order che specifica l'azione che la prima risorsa dovrà completare prima di eseguire l'azione specificata per la risorsa successiva.

source: Allowed values: <emphasis>start</emphasis>, stop, promote, demote
it_it: Valori permessi: <emphasis>start</emphasis>, stop, promote, demote

source: An additional attribute of ordering constraints that specifies the action that the then resource can only execute after the first-action on the first resource has completed.
it_it: Un'attributo aggiuntivo di una constraint di tipo order che specifica l'azione che la risorsa successiva potrà eseguire solamente dopo che l'azione first-action sulla prima risorsa sarà completata.

source: Allowed values: start, stop, promote, demote. Defaults to the value (specified or implied) of first-action
it_it: Valori permessi: start, stop, promote, demote. Il valore di default (specificato o implicito) è quello relativo a first-action

source: In the example below, myApp will wait until one of database copies has been started and promoted to master before being started itself. Only if no copies can be promoted will apache-stats be prevented from being active. Additionally, the database will wait for myApp to be stopped before it is demoted.
it_it: Nell'esempio sottostante, myApp aspetterà finché una delle copie del database verrà avviata e promossa a master prima di avviarsi essa stessa. Solo se nessuna copia può essere promossa allora apache-stats non sarà avviata. In aggiunta il database aspetterà finché myApp verra stoppata prima di essere degradato.

source: Colocation of a regular (or group) resource with a multi-state resource means that it can run on any machine with an active copy of the clone that is in the specified state (Master or Slave). In the example, the cluster will choose a location based on where database is running as a Master, and if there are multiple Master instances it will also factor in myApp‘s own location preferences when deciding which location to choose.
it_it: Effettuare una colocation di un risorsa regolare (o di un gruppo) con una risorsa multi-state significa che tale risorsa può funzionare solo la copia del clone è attiva nello stato specificato (Master o Slave). Nell'esempio, il cluster sceglierà la location in base a dove il database sta funzionando come Master. Se ci sono istanze Master multiple, ciò diventerà fattore di calcolo nel momento di decidere quale location scegliere per myApp.

source: Colocation with regular clones and other multi-state resources is also possible. In such cases, the set of allowed locations for the rsc clone is (after role filtering) limited to nodes on which the <literal>with-rsc</literal> clone is (or will be) in the specified role. Allocation is then performed as-per-normal.
it_it: E' possibile definire colocation con risorse clone regolari ed altre risorse multi-state. In questi casi, il set delle locazioni permesse per la risorsa clone (rsc) è limitata (dopo il filtro sul ruolo) ai nodi in cui la risorsa clone associata (with-rsc) è (o sarà) nel ruolo specifico. A quel punto l'allocazione procede come di consueto.

source: Example constraints involving multi-state resources
it_it: Esempio di constraint che coinvolge risorse multi-state

source: Which Resource Instance is Promoted
it_it: Quale istanza della risorsa è promossa

source: During the start operation, most Resource Agent scripts should call the <command>crm_master</command> utility. This tool automatically detects both the resource and host and should be used to set a preference for being promoted. Based on this, <literal>master-max</literal>, and <literal>master-node-max</literal>, the instance(s) with the highest preference will be promoted.
it_it: Durante l'operazione di avvio, molti script dei resource agent invocano l'utility <command>crm_master</command>. Questa utility rileva automaticamente sia la risorsa che l'host e dovrebbe essere usata per impostare la preferenza sull'essere promossa. Basandosi su questo, <literal>master-max</literal>, e <literal>master-node-max</literal> l'istanza con la più alta preferenza viene promossa.

source: Manually specifying which node should be promoted
it_it: Specificare manualmente quale nodo dovrebbe essere promosso

source: Since multi-state resources are an extension of cloned resources, all the requirements of Clones are also requirements of multi-state resources. Additionally, multi-state resources require two extra actions demote and promote. These actions are responsible for changing the state of the resource. Like start and stop, they should return <envar>OCF_SUCCESS</envar> if they completed successfully or a relevant error code if they did not.
it_it: Dal momneto che le risorse multi-state sono un'estensione delle risorse clonate, tutti i requisiti dei cloni sono requisiti anche delle risrose multi-state. In aggiunta, le risorse multi-state richiedono due azioni extra che sono demote e promote. Queste azioni sono responsabili del cambio di stato della risorsa. Come start e stop, devono restituire <envar>OCF_SUCCESS</envar> se tutto viene completato con successo o un codice di errore rilevante se qualcosa è andato storto.

source: The states can mean whatever you wish, but when the resource is started, it must come up in the mode called Slave. From there the cluster will then decide which instances to promote into a Master.
it_it: Gli stati possono significare qualsiasi cosa si voglia, ma quando la risorsa viene avviata, essa deve salire nella modalità denominata Slave. Da qui il cluster deciderà quindi quale istanza promuovere a Master.

source: In addition to the Clone requirements for monitor actions, agents must also <emphasis>accurately</emphasis> report which state they are in. The cluster relies on the agent to report its status (including role) accurately and does not indicate to the agent what role it currently believes it to be in.
it_it: In aggiunta ai requisiti per le azioni di monitor relativi alle risorse clone, gli agent devono anche riportare <emphasis>accuratamente</emphasis> in quale stato essi si trovano. Il cluster si affida all'agent per riportare il proprio stato (incluso il ruolo) accuratamente e non indica all'agente in quale ruolo ritiene che la risorsa si trovi.

source: Role implications of OCF return codes
it_it: Implicazioni dei ruoli nei return code OCF

source: Monitor Return Code
it_it: Return code del monitor

source: Stopped
it_it: Stoppato

source: Running (Slave)
it_it: Attivo (Slave)

source: Running (Master)
it_it: Attivo (Master)

source: Failed (Master)
it_it: Fallito (Master)

source: Other
it_it: Atro

source: Failed (Slave)
it_it: Fallito (Slave)

source: Like with clones, supporting notifications requires the <literal>notify</literal> action to be implemented. Once supported, the notify action will be passed a number of extra variables which, when combined with additional context, can be used to calculate the current state of the cluster and what is about to happen to it.
it_it: Come nei cloni, il supporto alle notifiche richiede che l'azione <literal>notify</literal> venga implementata. Una volta supportate, alle azioni notify verranno passati un numero extra di variabili che, quando combinate con contesti aggiuntivi, possono essere usate per calcolare lo stato attuale del cluster e cosa sta per succedere ad esso.

source: Environment variables supplied with Master notify actions <footnote><para>Variables in bold are specific to Master resources and all behave in the same manner as described for Clone resources.</para></footnote>
it_it: Variabili d'ambiente fornite con le azioni notify Master <footnote><para>Le variabili in grassetto sono specifiche alle risorse Master e si comportano allo stesso modo di come descritto per le risorse clone.</para></footnote>

source: Resources that are running in Master mode
it_it: Risorse che stanno funzionando in modalità master

source: Resources that are running in Slave mode
it_it: Risorse che stanno funzionando in modalità slave

source: Resources to be promoted
it_it: Risorse da promuovere

source: Resources to be demoted
it_it: Risorse da degradare

source: Nodes on which resources will be promoted
it_it: Nodi su cui la risorsa verrà promossa

source: Nodes on which resources will be demoted
it_it: Nodi su cui la risorsa verrà degradata

source: Nodes on which resources are running in Master mode
it_it: Nodi su cui le risorse stanno funzionando in modalità master

source: Nodes on which resources are running in Slave mode
it_it: Nodi su cui le risorse stanno funzionando in modalità slave

source: Master resources: $OCF_RESKEY_CRM_meta_notify_master_resource
it_it: Risorse master: $OCF_RESKEY_CRM_meta_notify_master_resource

source: Slave resources: $OCF_RESKEY_CRM_meta_notify_slave_resource
it_it: Risorse slave: $OCF_RESKEY_CRM_meta_notify_slave_resource

source: Resources to be promoted: $OCF_RESKEY_CRM_meta_notify_promote_resource
it_it: Risorse da promuovere: $OCF_RESKEY_CRM_meta_notify_promote_resource

source: Resources to be demoted: $OCF_RESKEY_CRM_meta_notify_demote_resource
it_it: Risorse da degradare: $OCF_RESKEY_CRM_meta_notify_demote_resource

source: Master resources:
it_it: Risorse master:

source: minus $OCF_RESKEY_CRM_meta_notify_demote_resource
it_it: meno $OCF_RESKEY_CRM_meta_notify_demote_resource

source: Resources that were demoted: $OCF_RESKEY_CRM_meta_notify_demote_resource
it_it: Risorse che sono state degradate: $OCF_RESKEY_CRM_meta_notify_demote_resource

source: Slave resources:
it_it: Risorse slave:

source: plus $OCF_RESKEY_CRM_meta_notify_promote_resource
it_it: più $OCF_RESKEY_CRM_meta_notify_promote_resource

source: minus $OCF_RESKEY_CRM_meta_notify_promote_resource
it_it: meno $OCF_RESKEY_CRM_meta_notify_promote_resource

source: Resources that were promoted: $OCF_RESKEY_CRM_meta_notify_promote_resource
it_it: Risorse che sono state promosse: $OCF_RESKEY_CRM_meta_notify_promote_resource
