Repository: 359887612/pacemaker
Catalog: doc/Pacemaker_Explained/*/Ch-Nodes.po
Languages: it_it

source: Cluster Nodes
it_it: Nodi del cluster

source: Defining a Cluster Node
it_it: Definire un nodo del cluster

source: Each node in the cluster will have an entry in the nodes section containing its UUID, uname and type.
it_it: Ad ogni nodo nel cluster corrisponderà una entry nella sezione nodi contenente il relativo UUID, il valore di uname ed il tipo.

source: Example cluster node entry
it_it: Esempio di una entry relativa ad un nodo cluster

source: In normal circumstances, the admin should let the cluster populate this information automatically from the communications and membership data. However one can use the crm_uuid tool to read an existing UUID or define a value before the cluster starts.
it_it: In circostanze normali, l'amministratore dovrebbe lasciar popolare le informazioni automaticamente al cluster in base ai dati di communication e membership. Ad ogni modo è possibile utilizzare lo strumento crm_uuid per leggere un UUID esistente o definire un valore prima che il cluster si avii.

source: Describing a Cluster Node
it_it: Descrivere un nodo del cluster

source: Beyond the basic definition of a node, the administrator can also describe the node&#39;s attributes, such as how much RAM, disk, what OS or kernel version it has, perhaps even its physical location. This information can then be used by the cluster when deciding where to place resources. For more information on the use of node attributes, see the section on <xref linkend="ch-rules" />.
it_it: Al di la della definizione base di un nodo, l'amministratore può inoltre descriverne gli attributi, come ad esempio quanta RAM, disco, quale sistema operativo o versione di kernel monta, forse anche la locazione fisica. Queste informazioni possono quindi essere utilizzate dal cluster nel momento in cui viene deciso dove porre le risorse. Per ulteriori informazioni sull'uso degli attributi del nodo, vedere la sezione <xref linkend="ch-rules" />.

source: Node attributes can be specified ahead of time or populated later, when the cluster is running, using <command>crm_attribute</command>.
it_it: Gli attributi dei nodi possono essere specificati a priori o popolate in seguito, quando il cluster sta funzionando, utilizzando <command>crm_attribute</command>.

source: Below is what the node&#39;s definition would look like if the admin ran the command:
it_it: Ecco riportato come sarà la definzione del nodo se l'amministratore lancia il comando:

source: The result of using crm_attribute to specify which kernel pcmk-1 is running
it_it: Risultato dell'utilizzo di crm_attribute per specificare quale kernel sta funzionando su pcmk-1

source: A simpler way to determine the current value of an attribute is to use crm_attribute command again:
it_it: Una via più semplice per determinare il valore corrente di un attributo è di utilizzare nuovamente il comando crm_attribute:

source: By specifying <parameter>--type</parameter> nodes the admin tells the cluster that this attribute is persistent. There are also transient attributes which are kept in the status section which are &#34;forgotten&#34; whenever the node rejoins the cluster. The cluster uses this area to store a record of how many times a resource has failed on that node but administrators can also read and write to this section by specifying <parameter>--type status</parameter>.
it_it: Specificando <parameter>--type</parameter> nodes, l'amministratore comunica al cluster che l'attributo è persistente. Esistono inoltre attributi transitori presenti nella sezione status che sono &#34;dimenticati&#34; ogni volta che il nodo diventa parte nuovamente del cluster. Il cluster utilizza quest'area per registrare il valore relativo a quante volte una risorsa è fallita su quel nodo, ma gli amministratoripossono inoltre leggere e scrivere in questa sezione specificando <parameter>--type status</parameter>.

source: Adding a New Cluster Node
it_it: Aggiungere un nuovo nodo al cluster

source: Adding a new is as simple as installing Corosync and Pacemaker, and copying <filename>/etc/corosync/corosync.conf</filename> and <filename>/etc/ais/authkey</filename> (if it exists) from an existing node. You may need to modify the mcastaddr option to match the new node&#39;s IP address.
it_it: Aggiungere un nuovo nodo è fattibile installando Corosync e Pacemaker, e copiando <filename>/etc/corosync/corosync.conf</filename> e <filename>/etc/ais/authkey</filename> (se esiste) da un nodo esistente. Potrebbe essere necessario modificare l'opzione mcastaddr in modo che corrisponda all'indirizzo IP del nuovo nodo.

source: If a log message containing &#34;Invalid digest&#34; appears from Corosync, the keys are not consistent between the machines.
it_it: Se appare tra i log di Corosync un messaggio contenente &#34;Invalid digest&#34;, le chiavi tra le due macchine non sono consistenti.

source: Provided you specified autojoin any in <filename>ha.cf</filename>, adding a new is as simple as installing heartbeat and copying <filename>ha.cf</filename> and <filename>authkeys</filename> from an existing node.
it_it: A condizione che si sia specificato autojon any all'interno del file <filename>ha.cf</filename>, aggiungere un nuovo nodo è possibile semplicemente installando heartbeat e copiando i file <filename>ha.cf</filename> e <filename>authkeys</filename> da un nodo esistente.

source: If not, then after setting up <filename>ha.cf</filename> and <filename>authkeys</filename>, you must use the hb_addnode command before starting the new node.
it_it: Se l'opzione autojoin non è stata specificata, allora dopo aver modificato <filename>ha.cf</filename> e <filename>authkeys</filename>, sarà necessario utilizzare il comando bh_addnode prima di avviare il nuovo nodo.

source: Removing a Cluster Node
it_it: Rimuovere un nodo

source: Because the messaging and membership layers are the authoritative source for cluster nodes, deleting them from the CIB is not a reliable solution. First one must arrange for heartbeat to forget about the node (<replaceable>pcmk-1</replaceable> in the example below).
it_it: Poiché il livello di messaging e membership sono sorgenti autoritative per i nodi del cluster, la loro cancellazione dal CIB non è una via percorribile. Prima quindi è necessario fare in modo che heartbeat dimentichi il nodo in questione (<replaceable>pcmk-1</replaceable> nell'esempio sottostante).

source: On the host to be removed:
it_it: Sull'host da rimuovere:

source: Find and record the node&#39;s Corosync id: <command>crm_node -i</command>
it_it: Trova e registra l'id Corosync del nodo: <command>crm_node -i</command>

source: Stop the cluster: <command>/etc/init.d/corosync stop</command>
it_it: Stop del cluster: <command>/etc/init.d/corosync stop</command>

source: Next, from one of the remaining active cluster nodes:
it_it: Quindi, da uno dei nodi rimasti attivi:

source: Tell the cluster to forget about the removed host: <command>crm_node -R <replaceable>COROSYNC_ID</replaceable></command>
it_it: Comunica al cluster di dimenticare gli host rimossi: <command>crm_node -R <replaceable>COROSYNC_ID</replaceable></command>

source: Only now is it safe to delete the node from the CIB with:
it_it: Solamente ora è sicuro rimuovere il nodo dal CIB mediante:

source: Because the messaging and membership layers are the authoritative source for cluster nodes, deleting them from the CIB is not a reliable solution. First one must arrange for heartbeat to forget about the node (pcmk-1 in the example below). To do this, shut down heartbeat on the node and then, from one of the remaining active cluster nodes, run:
it_it: Poiché i livelli di messaging e membership sono le sorgenti autoritative per i nodi del cluster, cancellarli dal CIB non è una soluzione percorribile. Prima quindi è necessario fare in modo che heartbeat dimentichi il nodo (pcmk-1 in the example below). Per fare questo, è sufficiente fermare heartbeat sul nodo interessato e successivamente, sul nodo rimasto attivo nel cluster, lanciare:

source: Only then is it safe to delete the node from the CIB with:
it_it: Solo a questo punto è sicuro rimuovere il nodo dal CIB con:

source: Replacing a Cluster Node
it_it: Rimpiazzare un nodo del cluster

source: The five-step guide to replacing an existing cluster node:
it_it: Guida in cinque passi per rimpiazzare un nodo esistente del cluster:

source: Make sure the old node is completely stopped
it_it: Assicurarsi che il vecchio nodo sia completamente stoppato

source: Give the new machine the same hostname and IP address as the old one
it_it: Assegnare alla nuova macchina lo stesso hostname ed indirizzo IP della vecchia macchina

source: Install the cluster software :-)
it_it: Installare il software del cluster :-)

source: Copy <filename>/etc/corosync/corosync.conf</filename> and <filename>/etc/ais/authkey</filename> (if it exists) to the new node
it_it: Copiare <filename>/etc/corosync/corosync.conf</filename> e <filename>/etc/ais/authkey</filename> (se esiste) nel nuovo nodo

source: Start the new cluster node
it_it: Avviare il nuovo nodo del cluster

source: The seven-step guide to replacing an existing cluster node:
it_it: Guida in sette passi per rimpiazzare un nodo del cluster esistente:

source: Give the new machine the same hostname as the old one
it_it: Dare alla nuova macchina lo stesso hostname della vecchia

source: Go to an active cluster node and look up the UUID for the old node in <filename>/var/lib/heartbeat/hostcache</filename>
it_it: Su un nodo attivo del cluster localizzale l'UUID del vecchio nodo in <filename>/var/lib/heartbeat/hostcache</filename>

source: Install the cluster software
it_it: Installare il software del cluster

source: Copy ha.cf and authkeys to the new node
it_it: Copiare ha.cf ed authkeys nel nuovo nodo

source: On the new node, populate it&#39;s UUID using crm_uuid -w and the UUID from step 2
it_it: Sul vecchio nodo, popolare il file con il valore UUID utilizzando crm_uuid -w ed il valore UUID ricavato nel passo 2
