Repository: 359887612/pacemaker
Catalog: doc/Pacemaker_Explained/*/Ch-Options.po
Languages: it_it

source: Cluster Options
it_it: Opzioni del cluster

source: Special Options
it_it: Opzioni speciali

source: The reason for these fields to be placed at the top level instead of with the rest of cluster options is simply a matter of parsing. These options are used by the configuration database which is, by design, mostly ignorant of the content it holds. So the decision was made to place them in an easy to find location.
it_it: La ragione per cui questi campi vengono posti in cima anziché con il resto delle opzioni del cluster è meramente una questione di parsing. Queste opzioni sono utilizzate dal database di configurazione che è, per natura, piuttosto ignorante dei contenuti che detetiene. Quindi la decisione è stata presa in modo da porli in una locazione facile da individuare.

source: Configuration Version
it_it: Versione della configurazione

source: When a node joins the cluster, the cluster will perform a check to see who has the best configuration based on the fields below. It then asks the node with the highest (<varname>admin_epoch, epoch, num_updates</varname>) tuple to replace the configuration on all the nodes - which makes setting them and setting them correctly very important.
it_it: Quando un nodo aderisce al cluster, questo effettuerà un controllo per vedere chi ha la migliore configurazione in base ai campi riportati sotto. Esso domanda poi al nodo con la più alta (<varname>admin_epoch, epoch, num_updates</varname>) tupla di rimpiazzare la configurazione su tutti i nodi - il che implica una notevole importanza ai valori, i quali dovranno essere impostati correttamente.

source: Configuration Version Properties
it_it: Proprietà relative alla versione della configurazione

source: Field
it_it: Campo

source: Description
it_it: Descrizione

source: Never modified by the cluster. Use this to make the configurations on any inactive nodes obsolete.
it_it: Non viene mai modificata dal cluster. Viene utilizzata per applicare le configurazioni su qualsiasi nodo inattivo obsoleto.

source: <emphasis>Never set this value to zero</emphasis>, in such cases the cluster cannot tell the difference between your configuration and the &#34;empty&#34; one used when nothing is found on disk.
it_it: <emphasis>Non settare mai questo valore a zero</emphasis>, in questi casi il cluster non potrà determinare la differenza tra la configurazione attiva e quella &#34;vuota&#34; utilizzata quando non viene trovato nulla sul disco.

source: Incremented every time the configuration is updated (usually by the admin)
it_it: Incrementata ogni volta che la configurazione viene aggiornata (generalmente dall'admin)

source: Incremented every time the configuration or status is updated (usually by the cluster)
it_it: Incrementata ogni volta che la configurazione o lo stato vengono aggiornati (generalmente dal cluster)

source: Other Fields
it_it: Altri campi

source: Properties Controling Validation
it_it: Proprietà del controllo di validazione

source: Determines the type of validation being done on the configuration. If set to &#34;none&#34;, the cluster will not verify that updates conform the the DTD (nor reject ones that don&#39;t). This option can be useful when operating a mixed version cluster during an upgrade.
it_it: Determina il tipo di validazione effettuata sulla configurazione. Se valorizzata a &#34;none&#34; il cluster non verificherà che gli aggiornamenti siano conformi al DTD (e non scarterà quelli che non lo sono). Questa opzione può essere utile quando si opera con versioni del cluster mixate, durante un aggiornamento.

source: Fields Maintained by the Cluster
it_it: Campi gestiti dal cluster

source: Properties Maintained by the Cluster
it_it: Proprietà gestite dal cluster

source: Indicates where the last update came from. Informational purposes only.
it_it: Indica da dove è provenuto l'ultimo aggiornamento. Ha scopo puramente informativo.

source: Indicates when the configuration was last written to disk. Informational purposes only.
it_it: Indica quando la configurazione è stata scritta su disco. Ha scopo puramente informativo.

source: Indicates which cluster node is the current leader. Used by the cluster when placing resources and determining the order of some events.
it_it: Indica quale nodo del cluster è l'attuale capo. Viene utilizzato dal cluster durante l'assegnamento delle risorse e determinato l'ordine di alcuni eventi.

source: Indicates if the cluster has quorum. If false, this may mean that the cluster cannot start resources or fence other nodes. See no-quorum-policy below.
it_it: Indica se il cluster ha quorumi. Se valorizzata a "false" potrebbe significare che il cluster non può avviare risorse od effettuare il fence di altri nodi. Vedere no-quorum-policy sotto.

source: Note that although these fields can be written to by the admin, in most cases the cluster will overwrite any values specified by the admin with the &#34;correct&#34; ones. To change the <varname>admin_epoch</varname>, for example, one would use:
it_it: Da notare come sebbene questi campi possono essere impostati dall'admin, in molti casi il cluster li riscriverà qualsiasi valore specificato da admin con quelli &#34;corretti&#34;

source: A complete set of fields will look something like this:
it_it: Un set completo di campi assomiglierà a questo:

source: An example of the fields set for a cib object
it_it: Un esempio dei campi settati per un oggetto cib

source: Cluster options, as you&#39;d expect, control how the cluster behaves when confronted with certain situations.
it_it: Le opzioni del cluster, come presumibile, controllano come il cluster si comporta di fronte a determinate situazioni.

source: They are grouped into sets and, in advanced configurations, there may be more than one.<footnote> <para>This will be described later in the section on <xref linkend="ch-rules" /> where we will show how to have the cluster use different sets of options during working hours (when downtime is usually to be avoided at all costs) than it does during the weekends (when resources can be moved to the their preferred hosts without bothering end users)</para> </footnote> For now we will describe the simple case where each option is present at most once.
it_it: Esse sono raggruppate in set e, in configurazioni avanzate, ne possono esistere più di uno. <footnote> <para>Questo verrà descritto più avanti nel <xref linkend="ch-rules" /> dove verrà mostrato come sia possibile fare in modo che il cluster utilizzi diversi set di opzioni durante gli orari lavorativi (dove qualsiasi downtime va evitato ad ogni costo) e durate i weekend (quando le risorse possono essere spostate ai loro host preferiti senza annoiare gli utilizzatori finali)</para> </footnote> Per ora verrà descritto il semplice caso in cui ogni opzione è presente al massimo una volta.

source: Available Cluster Options
it_it: Opzioni disponibili nel cluster

source: Option
it_it: Opzione

source: The number of jobs that the TE is allowed to execute in parallel. The &#34;correct&#34; value will depend on the speed and load of your network and cluster nodes.
it_it: Il numero di job che il TE è abilitato ad eseguire in parallelo. Il valore &#34;corretto&#34; dipenderà dalla velocità e dal carico della rete e dei nodi del cluster.

source: What to do when the cluster does not have quorum. Allowed values:
it_it: Cosa fare quando il cluster non ha quorum. Valori permessi:

source: ignore - continue all resource management
it_it: ignore - continua a gestire tutte le risorse

source: freeze - continue resource management, but don&#39;t recover resources from nodes not in the affected partition
it_it: freeze - continua a gestire le risorse, ma non ripara risorse da nodi non presenti nella partizione interessata

source: stop - stop all resources in the affected cluster parition
it_it: stop - ferma tutte le risorse nella partizione del cluster interessata

source: suicide - fence all nodes in the affected cluster partition
it_it: suicide - effettua il fence di tutti i nodi nella partizione del cluster interessata

source: Can all resources run on any node by default?
it_it: Possono di default tutte le risorse funzionare su qualsiasi nodo?

source: Should failed nodes and nodes with resources that can&#39;t be stopped be shot? If you value your data, set up a STONITH device and enable this.
it_it: I nodi falliti ed i nodi con risorse che non possono essere fermate possono essere colpiti? Se si ritengono i propri dati importanti, sarà necessario configurare un dispositivo STONITH ed abilitare questa opzione.

source: If true, or unset, the cluster will refuse to start resources unless one or more STONITH resources have been configured also.
it_it: Se "true" o non valorizzata, il cluster rifiuterà di avviare risorse a meno che uno o più dispositivi STONITH siano stati configurati.

source: Action to send to STONITH device. Allowed values: reboot, poweroff.
it_it: Azione da inviare al dispositivo STONITH. Valori permessi: reboot, poweroff.

source: Round trip delay over the network (excluding action execution). The &#34;correct&#34; value will depend on the speed and load of your network and cluster nodes.
it_it: Ritardo guidato sulla rete (con esclusione dell'esecuzione dell'azione). Il valore &#34;corretto&#34; dipenderà dalla velocità e dal carico della propria rete e dai nodi del cluster.

source: Should deleted resources be stopped
it_it: Le risorse cancellate devono essere fermate?

source: Should deleted actions be cancelled
it_it: Le azioni cancellate devono essere annullate?

source: When set to FALSE, the cluster will instead use the resource&#39;s failcount and value for resource-failure-stickiness
it_it: Quando settata a FALSE il cluster utilizzerà invece il valore di failcount delle risorse ed il valore di resource-failure-stickiness

source: -1 (all)
it_it: -1 (tutti)

source: The number of PE inputs resulting in ERRORs to save. Used when reporting problems.
it_it: Il numero da salvare di input PE che risultano in stato ERROR. Utilizzato in fase di comunicazione di problemi.

source: The number of PE inputs resulting in WARNINGs to save. Used when reporting problems.
it_it: Il numero da salvare di input PE che risultano in stato WARNING. Utilizzato in fase di comunicazione di problemi.

source: The number of &#34;normal&#34; PE inputs to save. Used when reporting problems.
it_it: Il numero da salvare di input PE in stato &#34;normal&#34;. Utilizzato in fase di comunicazione di problemi.

source: You can always obtain an up-to-date list of cluster options, including their default values by running the pengine metadata command.
it_it: E' sempre possibile ottenere una lista aggiornata delle opzioni del cluster, inclusi i loro valori di default lanciando il comando pengine metadata.

source: Querying and Setting Cluster Options
it_it: Interrogare e valorizzare le opzioni del cluster

source: Cluster options can be queried and modified using the crm_attribute tool. To get the current value of cluster-delay, simply use:
it_it: Le opzioni del cluster possono essere interrogate e modificate mediante l'utilizzo dello strumento crm_attribute. Per ottenere il valore del parametro cluster-delay è sufficiente utilizzare:

source: which is more simply written as
it_it: più semplicemente scrivibile come

source: If a value is found, the you&#39;ll see a result such as this
it_it: Se viene trovato un valore, allora sarà possibile vederlo come segue

source: However if no value is found, the tool will display an error:
it_it: Ad ogni modo se nessun valore viene trovato lo strumento restituirà un errore:

source: To use a different value, eg. 30s, simply run:
it_it: Per utilizzare un valore differente, ad esempio 30s, è sufficiente lanciare:

source: To go back to the cluster&#39;s default value, you can then delete the value with:
it_it: Per ripristinare il valore di default è possibile cancellare il valore con:

source: When Options are Listed More Than Once
it_it: Quando le opzioni vengono elencate più di una volta

source: If you ever see something like the following, it means that the option you&#39;re modifying is present more than once.
it_it: Se capiterà mai di vedere quanto illustrato, il motivo risiederà nel fatto che sono state dichiarate le stesse opzioni più di una volta.

source: Deleting an option that is listed twice
it_it: Cancellare un'opzione dichiarata due volte

source: In such cases follow the on-screen instructions to perform the requested action. To determine which value is currently being used by the cluster, please refer to the the section on <xref linkend="ch-rules" />.
it_it: In questi casi seguendo le istruzioni a video sarà possibile eseguire l'azione richiesta. Per determinare quale valore è attualmente utilizzato dal cluster bisognerà fare riferimento al <xref linkend="ch-rules" />.
