Repository: 359887612/pacemaker
Catalog: doc/Pacemaker_Explained/*/Ch-Resources.po
Languages: it_it

source: An OCF resource with two recurring health checks performing different levels of checks
it_it: Una risorsa OCF con due controlli di sanità ricorrenti che effettuano differenti livelli di controllo

source: Disabling a Monitor Operation
it_it: Disabilitare un'operazione di monitoring

source: The easiest way to stop a recurring monitor is to just delete it. However there can be times when you only want to disable it temporarily. In such cases, simply add <literal>disabled=&#34;true&#34;</literal> to the operation&#39;s definition.
it_it: La via più semplice per fermare un monitor ricorrente è semplicemente quella di cancellarlo. Ad ogni modo ci saranno occasioni in cui l'esigenza sia semplicemente quella di disabilitare il controllo temporaneamente. In questi casi, sarà sufficiente aggiungere <literal>disabled=&#34;true&#34;</literal> akka definizione dell'operazione.

source: Example of an OCF resource with a disabled health check
it_it: Esempio di una risorsa OCF con controllo di sanità disabilitato

source: This can be achieved from the command-line by executing
it_it: L'operazione è effettuabile da linea di comando, eseguendo

source: Once you&#39;ve done whatever you needed to do, you can then re-enable it with
it_it: Una volta ottenuto il proprio scopo, sarà possibile riabilitare nuovamente il controllo con
