Repository: 359887612/pacemaker
Catalog: doc/Pacemaker_Explained/*/Ch-Resources.po
Languages: it_it

source: Cluster Resources
it_it: Risorse del cluster

source: What is a Cluster Resource
it_it: Cos'è una risorsa del cluster

source: The role of a resource agent is to abstract the service it provides and present a consistent view to the cluster, which allows the cluster to be agnostic about the resources it manages. The cluster doesn&#39;t need to understand how the resource works because it relies on the resource agent to do the right thing when given a start, stop or monitor command.
it_it: Il ruolo di un resource agent è quello di astrarre il servizio che eroga e presentarne una vista consistente al cluster, il che abilita il cluster ad essere all'oscuro delle risorse che gestisce. Il cluster non necessità di capire come funziona una risorsa perché si appoggia al resource agent per fare la cosa giusta quando viene eseguito uno start, uno stop o un comando di monitor.

source: For this reason it is crucial that resource agents are well tested.
it_it: Per questa ragione è cruciale che i resource agent siano ben testati.

source: Typically resource agents come in the form of shell scripts, however they can be written using any technology (such as C, Python or Perl) that the author is comfortable with.
it_it: Tipicamente i resource agents nascono come script di shell, tuttavia possono essere scritti utilizzando qualsiasi tecnologia (come C, Python o Perl) con la quale l'autore abbia familiarità.

source: Supported Resource Classes
it_it: Classi di risorse supportate

source: There are three basic classes of agents supported by Pacemaker. In order of encouraged usage they are:
it_it: Esistono tre classi base di agenti supportati da Pacemaker. Il cui utilizzo viene caldeggiato:

source: support parameters
it_it: supportare parametri

source: make them self describing, and
it_it: renderli auto esplicativi ed

source: extensible
it_it: estensibili

source: OCF specs have strict definitions of what exit codes actions must return <footnote> <para>Included with the cluster is the ocf-tester script which can be useful in this regard.</para> </footnote> The cluster follows these specifications exactly, and exiting with the wrong exit code will cause the cluster to behave in ways you will likely find puzzling and annoying. In particular, the cluster needs to distinguish a completely stopped resource from one which is in some erroneous and indeterminate state.
it_it: Le specifiche OCF hanno definizioni rigorose di quali exit code devono restituire <footnote> <para>Incluso nel cluster vi è lo script ocf-tester che può essere utile in questo senso.</para> </footnote>Il cluster segue esattamente queste specifiche e restituire un exit code non corretto causerebbe al cluster comportamenti inaspettati e noiosi difficili da interpretare. In particolare il cluster necessita di distinguere una risorsa competamente stoppata da una che si trova in stato errato o indeterminabile.

source: Parameters are passed to the script as environment variables, with the special prefix <envar>OCF_RESKEY_</envar>. So, if you need to be given a parameter which the user thinks of as ip it will be passed to the script as <envar>OCF_RESKEY_ip</envar>. The number and purpose of the parameters is completely arbitrary, however your script should advertise any that it supports using the meta-data command.
it_it: I parametri sono passati allo script come variabili d'ambiente, con il prefisso speciale <envar>OCF_RESKEY_</envar>. Quindi se la propria necessità è quella di utilizzare una variabile chiamata ip, questa verrà passata allo script come <envar>OCF_RESKEY_ip</envar>. Il numero e lo scopo dei parametri è completamente arbitrario, ad ogni modo lo script dovrebbe allertare su quali parametri supporta mediante il comando meta-data.

source: LSB resource agents are those found in <filename>/etc/init.d</filename>. Generally they are provided by the OS/distribution and in order to be used with the cluster, must conform to the LSB Spec.
it_it: I resource agents LSB si trovano in <filename>/etc/init.d</filename>. Generalmente sono forniti dalla distribuzione e per essere utilizzati con il cluster devono essere conformi alle specifiche LSB.

source: The LSB Spec (as it relates to init scripts) can be found at: <ulink url="http://refspecs.linux-foundation.org/LSB_3.0.0/LSB-Core-generic/LSB-Core-generic/iniscrptact.html" />
it_it: Le specifiche LSB (per come si riferiscono agli script di init) si trovano qui: <ulink url="http://refspecs.linux-foundation.org/LSB_3.0.0/LSB-Core-generic/LSB-Core-generic/iniscrptact.html" />

source: Many distributions claim LSB compliance but ship with broken init scripts. To see if your init script is LSB-compatible, see the FAQ entry <xref linkend="ap-lsb" />. The most common problems are:
it_it: Molte distribuzioni affermano di essere LSB compatibili, ma in realtà hanno script di init non funzionanti. Per vedere se i propri script di init sono LSB-compatibili fare riferimento alla FAQ <xref linkend="ap-lsb" />.

source: Not implementing the status operation at all
it_it: Assenza dell'operazione status

source: Not observing the correct exit status codes for start/stop/status actions
it_it: Assenza dell'exit status corretto per le azioni start/stop/status

source: Starting a started resource returns an error (this violates the LSB spec)
it_it: Lo start di una risorsa avviata restituisce un errore (questo viola le specifiche LSB)

source: Stopping a stopped resource returns an error (this violates the LSB spec)
it_it: Lo stop di una risorsa ferma restituisce un errore (questo viola le specifiche LSB)

source: Version 1 of Heartbeat came with its own style of resource agents and it is highly likely that many people have written their own agents based on its conventions. To enable administrators to continue to use these agents, they are supported by the new cluster manager.
it_it: La versione 1 di Heartbeat aveva un proprio stile per i resource agent e verosimilmente tutte le persone che hanno sviluppato propri resource agent si sono basati su queste convenzioni. Per fare in modo che gli amministratori continuino ad utilizzare quest agenti questi sono supportati dal nuovo cluster manager.

source: For more information, see: <ulink url="http://wiki.linux-ha.org/HeartbeatResourceAgent" />
it_it: Per ulteriori informazioni vedere: <ulink url="http://wiki.linux-ha.org/HeartbeatResourceAgent" />

source: The OCF class is the most preferred one as it is an industry standard, highly flexible (allowing parameters to be passed to agents in a non-positional manner) and self-describing.
it_it: La classe OCF è la preferita poiché è uno standard industriale, altamente flessibile (permettendo che i parametri vengano passati agli agenti in maniera non posizionale) ed auto esplicativi.

source: There is also an additional class, STONITH, which is used exclusively for fencing related resources. This is discussed later in <xref linkend="ch-stonith" />.
it_it: Esiste ancheuna classe aggiuntiva, STONITH, che viene usata esclusivamente per effettuare il fence delle risorse relative. L'argomento è trattato più avanti nel <xref linkend="ch-stonith" />.

source: Properties
it_it: Proprietà

source: These values tell the cluster which script to use for the resource, where to find that script and what standards it conforms to.
it_it: Questo valore indica al cluster quale script utilizzare per la risorsa, dove trovarlo ed a quali standard è conforme.

source: Properties of a Primitive Resource
it_it: Proprietà di una Primitive Resource

source: Field
it_it: Campo

source: Description
it_it: Descrizione

source: Your name for the resource
it_it: Il nome della risorsa

source: The standard the script conforms to. Allowed values: heartbeat, lsb, ocf, stonith
it_it: Lo standard a cui lo script è conforme. Valori permessi: heartbeat, lsb, ocf, stonith

source: The name of the Resource Agent you wish to use. eg. IPaddr or Filesystem
it_it: Il nome del Resource Agent che si vuole utilizzare. Ad esempio IPaddr o Filesystem

source: The OCF spec allows multiple vendors to supply the same ResourceAgent. To use the OCF resource agents supplied with Heartbeat, you should specify heartbeat here.
it_it: La specifica OCF consente fornitori multipli per lo stesso Resource Agent. Per utilizzare i resource agent OCF forniti da Heartbeat, andrebbe specificato qui "heartbeat".

source: Resource definitions can be queried with the crm_resource tool. For example
it_it: Le definizioni della risorsa possono essere interrogate con lo strumento crm_resource. Ad esempio

source: might produce
it_it: potrebbe restituire

source: An example LSB resource
it_it: Una risorsa LSB di esempio

source: One of the main drawbacks to LSB resources is that they do not allow any parameters
it_it: Uno dei principali svantaggi delle risorse LSB è che essi non supportano alcun parametro

source: or, for an OCF resource:
it_it: o, per una risorsa OCF:

source: An example OCF resource
it_it: Un esempio di risorsa OCF

source: or, finally for the equivalent legacy Heartbeat resource:
it_it: o, infine per la risora legacy Heartbeat equivalente:

source: An example Heartbeat resource
it_it: Una risorsa Heartbeat di esempio

source: Heartbeat resources take only ordered and unnamed parameters. The supplied name therefor indicates the order in which they are passed to the script. Only single digit values are allowed.
it_it: Le risorse heartbeat supportano solo parametri non ordinati e senza nome. Il nome fornito indica quindi l'ordine in cui essi vengono passati allo script. Sono permessi solo valori a singola cifra.

source: Resource Options
it_it: Opzioni delle risorse

source: Options are used by the cluster to decide how your resource should behave and can be easily set using the <parameter>--meta</parameter> option of the <command>crm_resource</command> command.
it_it: Le opzioni vengono utilizzate dal cluster per decidere come la propria risorsa debba comportarsi. Esse possono facilmente essere impostate utilizzando l'opzione <parameter>--meta</parameter> del comando <command>crm_resource</command>.

source: Options for a Primitive Resource
it_it: Opzioni per una Primitive Resource

source: If not all resources can be active, the cluster will stop lower priority resources in order to keep higher priority ones active.
it_it: Se non possono essere attive tutte le risorse, il cluster fermerà le risorse con la minore priorità in modo da mantenere attive quelle ad alta prorità.

source: What state should the cluster attempt to keep this resource in? Allowed values:
it_it: In quale stato il cluster deve cercare di tenere questa risorsa? Valori permessi:

source: Started - Allow the resource to be started (In the case of <link linkend="s-resource-multistate">multi-state</link> resources, they will not promoted to master)
it_it: Started - Permetti alla risorsa di essere avviata (nel caso di risorse <link linkend="s-resource-multistate">multi-state</link> esse non verranno promosse a master)

source: Master - Allow the resource to be started and, if appropriate, promoted
it_it: Master - Consenti alla risorsa di essere avviata e, se è il caso, promossa a master

source: Is the cluster allowed to start and stop the resource? Allowed values: true, false
it_it: Il cluster può avviare e stoppare la risorsa? Valori permessi: true, false

source: How much does the resource prefer to stay where it is? Defaults to the value of resource-stickiness in the rsc_defaults section
it_it: Quanto la risorsa deve preferire rimanere dov'è? Il valore di default corrisponde al valore resource-stickiness nella sezione rsc_defaults

source: How many failures should occur for this resource on a node before making the node ineligible to host this resource.
it_it: Quanti fallimenti si devono verificare su un nodo per questa risorsa prima di rendere il nodo ineleggibile all'erogazione di questa risorsa.

source: 0 (disabled)
it_it: 0 (disabilitata)

source: How many seconds to wait before acting as if the failure had not occurred (and potentially allowing the resource back to the node on which it failed.
it_it: Quanti secondo aspettare prima di agire come se il fallimento non si fosse verificato (abilitando potenzialmente la risorsa sul nodo in cui è fallita).

source: What should the cluster do if it ever finds the resource active on more than one node. Allowed values:
it_it: Cosa dovrebbe fare il cluster se mai trovasse la risorsa attiva su più di un nodo. Valori permessi:

source: block - mark the resource as unmanaged
it_it: block - marchiare la risorse come non gestita (unmanaged)

source: stop_only - stop all active instances and leave them that way
it_it: stop_only - ferma tutte le istanze attive a le lascia in questo stato

source: stop_start - stop all active instances and start the resource in one location only
it_it: stop_start - ferma tutte le istanze attive ed avvia le risorse in una sola posizione

source: If you performed the following commands on the previous LSB Email resource
it_it: Se sono stati eseguiti i seguenti comandi nella precedente risorsa LSB Email

source: the resulting resource definition would be
it_it: la definizione della risorsa risultate sarebbe

source: An LSB resource with cluster options
it_it: Una risorsa LSB con le opzioni cluster

source: Setting Global Defaults for Resource Options
it_it: Settaggio dei valori di default globali per le opzioni delle risorse

source: To set a default value for a resource option, simply add it to the <literal>rsc_defaults</literal> section with <command>crm_attribute</command>. Thus,
it_it: Per assegnare il valore di default dell'opzione di una risorsa è sufficiente aggiungerla alla sezione <literal>rsc_defaults</literal> mediante <command>crm_attribute</command>. In questo modo,

source: would prevent the cluster from starting or stopping any of the resources in the configuration (unless of course the individual resources were specifically enabled and had <literal>is-managed</literal> set to true).
it_it: verrà evitato che il cluster avvii o fermi una qualsiasi risorsa nella configurazione (a meno che le risorse siano specificamente abilitate e sia a true il valore <literal>is-managed</literal>).

source: Instance Attributes
it_it: Attributi dell'istanza

source: The scripts of some resource classes (LSB not being one of them) can be given parameters which determine how they behave and which instance of a service they control.
it_it: Gli script di alcune classi di risorse (ad esclusione di quelli LSB) supportano il passaggio di parametri che determinano come questi si devono comportare e quale istanza del servizio controllano.

source: If your resource agent supports parameters, you can add them with the <command>crm_resource</command> command. For instance
it_it: Se il resource agent prescelto supporta parametri, è possibile aggiungerli mediante il comando <command>crm_resource</command>. Ad esempio

source: would create an entry in the resource like this
it_it: creerà una entry come questa

source: An example OCF resource with instance attributes
it_it: Una risorsa OCF di esempio con attributi di istanza

source: For an OCF resource, the result would be an environment variable called <envar>OCF_RESKEY_ip</envar> with a value of 1.2.3.4
it_it: Per una risorsa OCF il risultato sarà una variabile d'ambiente chiamata <envar>OCF_RESKEY_ip</envar> il cui valore è 1.2.3.4

source: The list of instance attributes supported by an OCF script can be found by calling the resource script with the <parameter>meta-data</parameter> command. The output contains an XML description of all the supported attributes, their purpose and default values.
it_it: La lista degli attriuti di istanza supportati da uno script OCF può essere recuperata richiamando lo script con il comando <parameter>meta-data</parameter>. L'output contiene una descrizione XML di tutti gli attributi supportati, la loro funzione ed i valori di default.

source: Displaying the metadata for the Dummy resource agent template
it_it: Visualizzazione dei metadata per il template del resource agent Dummy

source: Resource Operations
it_it: Operazioni sulle risorse

source: Monitoring Resources for Failure
it_it: Monitoraggio di anomalie sulle risorse

source: By default, the cluster will not ensure your resources are still healthy. To instruct the cluster to do this, you need to add a monitor operation to the resource&#39;s definition.
it_it: Come comportamento di default il cluster non accerterà che le risorse siano in salute. Per istruire il cluster a farlo è necessario aggiungere alla definizione della risorsa un'operazione di monitor.

source: An OCF resource with a recurring health check
it_it: Una risorsa OCF con un controllo dello stato di salute ciclico

source: Properties of an Operation
it_it: Proprietà di un'operazione

source: Your name for the action. Must be unique.
it_it: Nome assegnato all'azione. Deve essere univoco.

source: The action to perform. Common values: monitor, start, stop
it_it: L'azione da eseguire. Valori possibili: monitor, start, stop

source: How frequently (in seconds) to perform the operation. Default value: 0
it_it: Quanto frequentemente (in secondi) effettuare l'operazione. Valore di default: 0

source: How long to wait before declaring the action has failed.
it_it: Quanto aspettare prima di dichiarare che un'azione è fallita.

source: What conditions need to be satisfied before this action occurs. Allowed values:
it_it: Quali condizioni devono essere soddisfatte prima che l'azione avvenga. Valori permessi:

source: nothing - The cluster may start this resource at any time
it_it: nothing - Il cluster può avviare la risorsa quando vuole

source: quorum - The cluster can only start this resource if a majority of the configured nodes are active
it_it: quorum - Il cluster può avviare questa risorsa solamente se la maggioranza dei nodi configurati è attiva

source: fencing - The cluster can only start this resource if a majority of the configured nodes are active <emphasis>and</emphasis> any failed or unknown nodes have been powered off.
it_it: fencing - Il cluster può avviare questa risorsa solo se la maggioranza dei nodi configurati è attiva <emphasis>e</emphasis> qualsiasi nodo fallito o sconosciuto è stato spento.

source: STONITH resources default to nothing, and all others default to fencing if STONITH is enabled and quorum otherwise.
it_it: Le risorse STONITH per default non fanno nulla mentre tutte le altre, per default, utilizzano "fencing" se STONITH è abilitato nel cluster e "quorum" in tutti gli altri casi.

source: The action to take if this action ever fails. Allowed values:
it_it: L'azione da intraprendere se l'azione principale dovesse fallire. Valori permessi:

source: ignore - Pretend the resource did not fail
it_it: ignore - Pretende che la risorsa non fallisca.

source: block - Don&#39;t perform any further operations on the resource
it_it: block - Non effettuar alcuna altra operazione sulla risorsa

source: stop - Stop the resource and do not start it elsewhere
it_it: stop - Ferma la risorsa che non verrà avviata da nessuna parte

source: restart - Stop the resource and start it again (possibly on a different node)
it_it: restart - Ferma la risorsa e la avvia di nuovo (possibilmente su di un altro nodo)

source: fence - STONITH the node on which the resource failed
it_it: fence - effettua lo STONITH sul nodo dove è fallita la risorsa

source: standby - Move <emphasis>all</emphasis> resources away from the node on which the resource failed
it_it: standby - Sposta <emphasis>tutte</emphasis> le risorse altrove dal nodo in cui queste sono fallite

source: The default for the stop operation is fence when STONITH is enabled and block otherwise. All other operations default to stop.
it_it: Il valore di default per l'operazione di stop è "fence" quando STONITH è abilitato e "block" negli altri casi. Tutte le altre operazioni per default utilizzano "stop".

source: If false, the operation is treated as if it does not exist. Allowed values: <emphasis>true</emphasis>, false
it_it: Se impostato a "false" l'operazione viene trattata come se non esiste. Valori permessi: <emphasis>true</emphasis>, false

source: Setting Global Defaults for Operations
it_it: Settaggio dei valori di default globali per le operazioni

source: To set a default value for a operation option, simply add it to the op_defaults section with crm_attribute. Thus,
it_it: Per impostare il valore di default dell'opzione di un'operazione è sufficiente aggiungerlo alla sezione op_defaults section mediante crm_attribute. Quindi.

source: would default each operation&#39;s timeout to 20 seconds. If an operation&#39;s definition also includes a value for <literal>timeout</literal>, then that value would be used instead (for that operation only).
it_it: imposterà 20 secondi come valore di default per ciascuna operazione. Se la definizione dell'operazione include anche un valore per il <literal>timeout</literal>, allora verrà utilizzato questo valore (solamente per questa operazione).

source: When Resources Take a Long Time to Start/Stop
it_it: Quando una risorsa impiega molto tempo per Avviarsi/Fermarsi

source: There are a number of implicit operations that the cluster will always perform - start, stop and a non-recurring monitor operation (used at startup to check the resource isn&#39;t already active). If one of these is taking too long, then you can create an entry for them and simply specify a new value.
it_it: Esistono diverse operazioni implicite che il cluster effettuerà sempre - start, stop e monitoraggi non ricorrenti (utilizzati in fase di avvio per verificare che la risorsa non sia già attiva). Se una di queste impiega troppo tempo, sarà possibile creare una entry relativa e specificare semplicemente un nuovo valore.

source: An OCF resource with custom timeouts for its implicit actions
it_it: Una risorsa OCF on timeout personalizzato per le proprie azioni implicite

source: Multiple Monitor Operations
it_it: Operazioni di monitoraggio multiple

source: Provided no two operations (for a single resource) have the same name and interval you can have as many monitor operations as you like. In this way you can do a superficial health check every minute and progressively more intense ones at higher intervals.
it_it: Purché non ci sono due operazioni (per una singola risorsa) con lo stesso nome ed intervallo è possibile avere un umero arbitrario di operazioni di monitoraggio . In questo modo si può fare un controllo superficiale ogni minuto, che si intensificherà con intervalli più alti.

source: To tell the resource agent what kind of check to perform, you need to provide each monitor with a different value for a common parameter. The OCF standard creates a special parameter called <envar>OCF_CHECK_LEVEL</envar> for this purpose and dictates that it is <emphasis>made available to the resource agent without the normal <envar>OCF_RESKEY_</envar> prefix</emphasis>.
it_it: Per comunicare al resource agent che tipo di controllo effettuare è necessario fornire ogni monitor con un valore di parametro comune differente. Lo standard OCF, per questo scopo, crea un parametro speciale denominato <envar>OCF_CHECK_LEVEL</envar> ed impone che questo <emphasis>sia reso disponibile al resource agent senza il normale prefisso <envar>OCF_RESKEY_</envar></emphasis>.

source: Whatever name you choose, you can specify it by adding an instance_attributes block to the op tag. Note that it is up to each resource agent to look for the parameter and decide how to use it.
it_it: Qualsiasi nome venga scelto sarà possibile specificarlo aggiungendo un blocco instance_attributes al tag op. Va sottolineato come è compito di ciascun resource agent controllae il parametro e decidere come utilizzarlo.
