Repository: 359887612/pacemaker
Catalog: doc/Pacemaker_Explained/*/Ch-Stonith.po
Languages: it_it

source: Protecting Your Data - STONITH
it_it: Proteggere i propri dati - STONITH

source: Why You Need STONITH
it_it: Perché c'è bisogno di STONITH

source: <ulink url="http://en.wikipedia.org/wiki/STONITH">STONITH</ulink> is an acronym for Shoot-The-Other-Node-In-The-Head and it protects your data from being corrupted by rogue nodes or concurrent access.
it_it: <ulink url="http://en.wikipedia.org/wiki/STONITH">STONITH</ulink> è l'acronimo di Shoot-The-Other-Node-In-The-Head (Spara in testa all'altro nodo) e protegge i propri dati dall'essere corrotti mediante nodi ribelli od accessi concorrenti.

source: Just because a node is unresponsive, this doesn&#39;t mean it isn&#39;t accessing your data. The only way to be 100% sure that your data is safe, is to use STONITH so we can be certain that the node is truly offline, before allowing the data to be accessed from another node.
it_it: Solo perché un nodo non risponde, non significa che non sta accedendo ai dati. L'unica via per essere al 100% certi che i propri dati siano al sicuro è quella di utilizzare STONITH in modo da essere certi che un nodo sia realmente spento, prima di consentire l'accesso ai dati ad un altro nodo.

source: STONITH also has a role to play in the event that a clustered service cannot be stopped. In this case, the cluster uses STONITH to force the whole node offline, thereby making it safe to start the service elsewhere.
it_it: STONITH ha un ruolo da gionare anche nel caso in cui i servizi clusterizzati non possono essere stoppati. In questi casi, il cluster utilizza STONITH per spegnere forzatamente l'intero nodo, ed essere quindi certo che il servizio possa essere avviato altrove in sicurezza.

source: What STONITH Device Should You Use
it_it: Quale STONITH device si dovrebbe usare

source: It is crucial that the STONITH device can allow the cluster to differentiate between a node failure and a network one.
it_it: E' cruciale che il device STONITH consenta al cluster di differenziare tra un'anomalia del nodo ed una di rete.

source: The biggest mistake people make in choosing a STONITH device is to use remote power switch (such as many on-board IMPI controllers) that shares power with the node it controls. In such cases, the cluster cannot be sure if the node is really offline, or active and suffering from a network fault.
it_it: Il più grande errore generalmente commesso nella scelta del device STONITH è quello di usare un remote power switch (come molti on-board IMPI controller) che condividono l'alimentazione con il nodo che controllano. In questi casi, il cluster non può essere certo del fatto che il nodo sia realmente offline, oppure attivo, ma con problemi di rete.

source: Likewise, any device that relies on the machine being active (such as SSH-based &#34;devices&#34; used during testing) are inappropriate.
it_it: Similarmente ogni device che risiede sulla macchina attiva (come i device SSH utilizzati per i test) risulta inappropriato.

source: Configuring STONITH
it_it: Configurare STONITH

source: Find the correct driver: <command>stonith_admin --list-installed</command>
it_it: Determinare il driver corretto: <command>stonith_admin --list-installed</command>

source: Since every device is different, the parameters needed to configure it will vary. To find out the parameters associated with the device, run:
it_it: Dato che ogni device è diverso, i parametri necessari per configurarlo possono variare. Per trovare i parametri associati al device è sufficiente lanciare:

source: The output should be XML formatted text containing additional parameter descriptions. We will endevor to make the output more friendly in a later version.
it_it: L'output dovrebbe risultare in testo formattato in XML contenente le descrizioni dei parametri. Nelle prossime versioni l'output verrà reso più leggibile.

source: Create a file called stonith.xml containing a primitive resource with a class of stonith, a type of <replaceable>type</replaceable> and a parameter for each of the values returned in step 2
it_it: Creare un file chiamato stonith.xml contenente una risorsa primitiva con una classe di stonith, un tipo di <replaceable>type</replaceable> ed un parametro per ciascuno dei valori restituiti nel passo 2

source: If the device does not know how to fence nodes based on their uname, you may also need to set the special <constant>pcmk_host_map</constant> parameter. See <command>man stonithd</command> for details.
it_it: Se il device non conosce come effettuare il fence dei nodi in base al relativo uname, potrebbe essere necessario valorizzare il parametro speciale <constant>pcmk_host_map</constant>. Vedere <command>man stonithd</command> per i dettagli.

source: If the device does not support the <constant>list</constant> command, you may also need to set the special <constant>pcmk_host_list</constant> and/or <constant>pcmk_host_check</constant> parameters. See <command>man stonithd</command> for details.
it_it: Se il device non supporta il comando <constant>list</constant> è possibile valorizzare i parametri speciali <constant>pcmk_host_list</constant> e/o <constant>pcmk_host_check</constant>. Vedere <command>man stonithd</command> per dettagli.

source: If the device does not expect the victim to be specified with the <constant>port</constant> parameter, you may also need to set the special <constant>pcmk_host_argument</constant> parameter. See <command>man stonithd</command> for details.
it_it: Se il device non si aspetta che la vittima venga specificata con il parametro <constant>port</constant>, potrebbe essere necessario valorizzare il parametro speciale <constant>pcmk_host_argument</constant>. Vedere <command>man stonithd</command> per dettagli.

source: Upload it into the CIB using cibadmin: <command>cibadmin -C -o resources --xml-file <filename><replaceable>stonith.xml</replaceable></filename></command>
it_it: Effettuare l'upload all'interno del CIB utilizzando cibadmin: <command>cibadmin -C -o resources --xml-file <filename><replaceable>stonith.xml</replaceable></filename></command>

source: Once the stonith resource is running, you can test it by executing: <command>stonith_admin --reboot <replaceable>nodename</replaceable></command>. Although you might want to stop the cluster on that machine first.
it_it: Una volta che la risorsa stonith sta funzionando, è possibile testarla eseguendo: <command>stonith_admin --reboot <replaceable>nodename</replaceable></command>. Su questa macchina sarebbe certamente preferibile effettuare prima uno stop del servizio cluster.

source: Example
it_it: Esempio

source: Assuming we have an chassis containing four nodes and an IPMI device active on 10.0.0.1, then we would chose the <literal>fence_ipmilan</literal> driver in step 2 and obtain the following list of parameters
it_it: Assumendo di possedere uno chassis contenente quattro nodi ed un device IPMI attivo su 10.0.0.1, allora nel passo 2 verrà selezionato il driver <literal>fence_ipmilan</literal> e si otterrà la seguente lista di parametri

source: Obtaining a list of STONITH Parameters
it_it: Ottenere la lista dei parametri STONITH

source: from which we would create a STONITH resource fragment that might look like this
it_it: da cui sarà possibile creare una risorsa STONITH che assomigli alla seguente

source: Sample STONITH Resource
it_it: Esempio di risorsa STONITH
