Repository: 359887612/pacemaker
Catalog: doc/Clusters_from_Scratch/*/Ch-Stonith.po
Languages: it_it

source: Configure STONITH
it_it: Configurare STONITH

source: Why You Need STONITH
it_it: Perché STONITH è necessario

source: STONITH is an acronym for Shoot-The-Other-Node-In-The-Head and it protects your data from being corrupted by rouge nodes or concurrent access.
it_it: STONITH è l'acronimo di Shoot-The-Other-Node-In-The-Head e protegge i dati dalla corruzione derivante da accessi concorrenti incontrollati.

source: Just because a node is unresponsive, this doesn’t mean it isn’t accessing your data. The only way to be 100% sure that your data is safe, is to use STONITH so we can be certain that the node is truly offline, before allowing the data to be accessed from another node.
it_it: Solo perché un nodo non è responsivo non significa che non stia accedendo ai dati. L'unica via per essere sicuri al 100% che i dati sono al sicuro è quella di utilizzare STONITH in modo da essere certi che il nodo sia effettivamente offline, prima di consentire ad altri nodi di accedere ai dati.

source: STONITH also has a role to play in the event that a clustered service cannot be stopped. In this case, the cluster uses STONITH to force the whole node offline, thereby making it safe to start the service elsewhere.
it_it: STONITH gioca un ruolo importante anche nel caso in cui un servizio clusterizzato non può essere stoppato. In questo caso il cluster utilizza STONITH per forzare l'intero nodo offline, rendendo di fatto sicuro l'avvio del servizio altrove.

source: What STONITH Device Should You Use
it_it: Quale device STONITH andrebbe utilizzato

source: It is crucial that the STONITH device can allow the cluster to differentiate between a node failure and a network one.
it_it: E' cruciale che il device STONITH sia in grado di differenziare un guasto del nodo da un guasto di rete.

source: The biggest mistake people make in choosing a STONITH device is to use remote power switch (such as many onboard IMPI controllers) that shares power with the node it controls. In such cases, the cluster cannot be sure if the node is really offline, or active and suffering from a network fault.
it_it: L'errore più grande commesso nello scegliere un device STONITH è di utilizzare un "remote power switch" (come molti IMPI onboard controller) che condivide l'alimentazione con il nodo che controlla. In questi casi, il cluster non può essere sicuro che il nodo sia realmente offline o attivo ma staccato dalla rete.

source: Likewise, any device that relies on the machine being active (such as SSH-based “devices” used during testing) are inappropriate.
it_it: Allo stesso modo, ogni device che risiede su una macchina attiva (come il device basato su SSH utilizzato durante i test) risulta inappropriato.

source: Configuring STONITH
it_it: Configurare STONITH

source: Find the correct driver: stonith -L
it_it: Individuare il driver corretto: stonith -L

source: Since every device is different, the parameters needed to configure it will vary. To find out the parameters required by the device: stonith -t {type} -n
it_it: Dal momento che ogni device è diverso dagli altri, i parametri necessari a configurarlo saranno vari. Per individuare i parametri richiesti dal device: stonith -t {type} -n

source: Hopefully the developers chose names that make sense, if not you can query for some additional information by finding an active cluster node and running:
it_it: Fortunatamente gli sviluppatori hanno scelto nomi che hanno senso, altrimenti è possibile ricavare informazioni aggiuntive recandosi su un nodo attivo del cluster e lanciando:

source: The output should be XML formatted text containing additional parameter descriptions
it_it: L'output dovrebbe essere testo formattato in XML contenente parametri descrittori aggiuntivi

source: Create a file called stonith.xml containing a primitive resource with a class of stonith, a type of {type} and a parameter for each of the values returned in step 2
it_it: Creare un file chiamato stonith.xml contenente una risorsa primitiva di classe stonith, un tipo {type} ed un parametro per ciascuno dei valori ricavati nello step 2

source: Create a clone from the primitive resource if the device can shoot more than one node<emphasis> and supports multiple simultaneous connections</emphasis>.
it_it: Creare un clone dalla risorsa primitiva se il device può sparare a più di un singolo nodo<emphasis> e supporta connessioni simultanee multiple</emphasis>.

source: Upload it into the CIB using cibadmin: cibadmin -C -o resources --xml-file stonith.xml
it_it: Caricare il file nel CIB utilizzando cibadmin: cibadmin -C -o resources --xml-file stonith.xml

source: Example
it_it: Esempio

source: Assuming we have an IBM BladeCenter containing our two nodes and the management interface is active on 192.168.122.31, then we would chose the external/ibmrsa driver in step 2 and obtain the following list of parameters
it_it: Assumendo di possedere un IBM BladeCenter contenente i due nodi e che l'interfaccia di gestione sia attiva su 192.168.122.31, verrà quindi scelto il driver external/ibmrsa, ottenendo la seguente lista di parametri

source: Assuming we know the username and password for the management interface, we would create a STONITH resource with the shell
it_it: Assumendo di conoscere lo username e la password per l'interfaccia di gestione, verrà creata una risorsa STONITH con la shell

source: And finally, since we disabled it earlier, we need to re-enable STONITH
it_it: Ed infine, visto che era stato disabilitato in precedenza, è necessario riabilitare STONITH
